projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/АРМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardBeginningDate</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйДокументДляОтправки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусТранзита</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаНачалаТранзита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОформления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераCMR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоCMR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТаможниОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принципал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КППКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныеСредства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПакетДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ТарифныеСеткиОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСеткиОбеспечения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикиСуммЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/АРМ/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных
// Доработка {H-10 2026-05-20}: флаг защиты от двойного клика на массовых операциях.
&НаКлиенте
Перем ВыполняетсяМассоваяОперация Экспорт;
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДинамическиеСписки();

	Элементы.СписокГотовыхОпераций.ИзменятьСоставСтрок = Ложь;
	Элементы.СписокОшибочныеОперации.ИзменятьСоставСтрок = Ложь;
	Элементы.СписокОшибокРасчетов.ИзменятьСоставСтрок = Ложь;
	Элементы.ВсеОперации.ИзменятьСоставСтрок = Ложь;

	// Доработка {UX-2 2026-05-20}: переименование команд в понятные оператору. Названия
	// "Сохранить"/"Отправить" сами по себе неоднозначные - меняем заголовки программно
	// чтобы не править Form.xml. Имя самой команды не трогаем (на него завязан обработчик).
	Попытка
		Команды.Сохранить.Заголовок  = "Сохранить отчёты на диск";
		Команды.Отправить.Заголовок  = "Отправить отчёты по почте";
		Команды.Расчитать.Заголовок  = "Рассчитать";
	Исключение
		ЗаписьЖурналаРегистрации("АРМ.ПриСозданииНаСервере.ЗаголовкиКоманд",
			УровеньЖурналаРегистрации.Предупреждение, , , ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДинамическиеСписки();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьДинамическиеСписки();
	ПочтаДляОтправки.Очистить();
КонецПроцедуры


#Область ДинамическиеСписки

Процедура ЗаполнитьДинамическиеСписки()

	// Доработка {M-2 2026-05-20}: устранение 4-кратного дублирования через массив списков.
	ВсеСписки = Новый Массив;
	ВсеСписки.Добавить(СписокОшибочныеОперации);
	ВсеСписки.Добавить(СписокГотовыхОпераций);
	ВсеСписки.Добавить(СписокОшибокРасчетов);
	ВсеСписки.Добавить(ВсеОперации);

	Для Каждого Список Из ВсеСписки Цикл
		Список.Отбор.Элементы.Очистить();
	КонецЦикла;

	// Отбор по контрагенту
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Для Каждого Список Из ВсеСписки Цикл
			ДобавитьОтборСписка(Список, "Контрагент", Объект.Контрагент,
				ВидСравненияКомпоновкиДанных.Равно);
		КонецЦикла;
	Иначе
		// При пустом контрагенте показываем только списки К расчету и Готовы к отгрузке с пустым контрагентом
		ДобавитьОтборСписка(СписокОшибокРасчетов, "Контрагент",
			Справочники.Контрагенты.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно);
		ДобавитьОтборСписка(СписокГотовыхОпераций, "Контрагент",
			Справочники.Контрагенты.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	// Отбор по периоду
	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Для Каждого Список Из ВсеСписки Цикл
			ДобавитьОтборСписка(Список, "Дата", Период.ДатаНачала,
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			ДобавитьОтборСписка(Список, "Дата", Период.ДатаОкончания,
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
		КонецЦикла;
	КонецЕсли;

	// Отбор по парому/рейсу
	Если Рейс <> Неопределено Тогда
		Для Каждого Список Из ВсеСписки Цикл
			ДобавитьОтборСписка(Список, "Паром", Рейс,
				ВидСравненияКомпоновкиДанных.Равно);
		КонецЦикла;
	КонецЕсли;

	// Доработка {Аудит 2026-04-04}: обновление списков с фильтрами.
	Элементы.СписокОшибочныеОперации.Обновить();
	Элементы.СписокОшибокРасчетов.Обновить();

	КоличествоВСписках();

КонецПроцедуры

// Вспомогательная: добавляет один элемент отбора в динамический список.
&НаСервере
Процедура ДобавитьОтборСписка(Список, ИмяПоля, Значение, ВидСравнения)
	Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	Элемент.Использование = Истина;
	Элемент.ПравоеЗначение = Значение;
КонецПроцедуры

#КонецОбласти   

&НаКлиенте
Процедура ЗаполнитьКонтрагента(Команда) 
	ОткрытьФормуИВернутьВведенныеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИВернутьВведенныеДанные()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКонтрагента", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", , ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте 
Процедура ОбработкаВыбораКонтрагента(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.Контрагенты") Тогда 
		КонтрагентДляЗаполнения = РезультатВыбора;
	КонецЕсли; 
	ЗаполнитьКонтрагентаПриВыборе();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтрагентаПриВыборе()
	Если НЕ ЗначениеЗаполнено(КонтрагентДляЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	Итог = ЗаполнитьКонтрагентаНаСервере();
	ЗаполнитьДинамическиеСписки();
	Если ЗначениеЗаполнено(Итог) Тогда
		ПоказатьПредупреждение(, Итог);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКонтрагентаНаСервере()

	ВыдСтроки = Элементы.СписокОшибочныеОперации.ВыделенныеСтроки;

	СчУспех = 0;
	СчПропущено = 0;
	СчОшибок = 0;

	// Доработка {Аудит 2026-04-04}: Возврат→Продолжить, удален лишний Записать, добавлена Попытка.
	// Доработка {UX-3 2026-05-20}: счетчики и сводный итог пользователю.
	Для Каждого Стр Из ВыдСтроки Цикл
		Попытка
			Док = Стр.ПолучитьОбъект();
			Если ЗначениеЗаполнено(Док.Контрагент) Тогда
				СчПропущено = СчПропущено + 1;
				Продолжить;
			КонецЕсли;
			Док.Контрагент = КонтрагентДляЗаполнения;
			Док.Записать(РежимЗаписиДокумента.Проведение);
			СчУспех = СчУспех + 1;
		Исключение
			СчОшибок = СчОшибок + 1;
			ЗаписьЖурналаРегистрации("АРМ.ЗаполнениеКонтрагента",
				УровеньЖурналаРегистрации.Ошибка, , Стр, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	Если СчУспех + СчПропущено + СчОшибок = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат "Заполнено: " + СчУспех + ", пропущено (уже было): " + СчПропущено
		+ ", с ошибками: " + СчОшибок + ".";

КонецФункции

// Доработка START {Пересборка: повторная идентификация + группировка неидентифицированных} {2026-04-05}
// Доработка {2026-04-14}: кнопка в шапке, период обязателен, обертка Попытка
// Доработка {Perf #2 2026-05-20}: batch-lookup контрагентов и целевых документов
//                                 (вместо N+1), транзакция на каждую группу,
//                                 разбиение монолита на функции.
&НаКлиенте
Процедура ПересобратьДокументы(Команда)

	Если ВыполняетсяМассоваяОперация = Истина Тогда
		ПоказатьПредупреждение(, "Дождитесь завершения предыдущей операции.");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПоказатьПредупреждение(, "Укажите период для пересборки документов.");
		Возврат;
	КонецЕсли;

	ВыполняетсяМассоваяОперация = Истина;
	Попытка
		Результат = ПересобратьДокументыНаСервере();
	Исключение
		ВыполняетсяМассоваяОперация = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	ВыполняетсяМассоваяОперация = Ложь;

	Если ЗначениеЗаполнено(Результат) Тогда
		ПоказатьПредупреждение(, Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПересобратьДокументыНаСервере()

	Попытка

		// 1. Все неидентифицированные за период
		ТЗДокументов = ПолучитьНеидентифицированныеДокументы();
		Если ТЗДокументов.Количество() = 0 Тогда
			Возврат "Нет неидентифицированных документов за период "
				+ Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " - "
				+ Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy") + ".";
		КонецЕсли;

		// 2. Извлечь email из комментариев
		Для Каждого Стр Из ТЗДокументов Цикл
			Стр.Email = ИзвлечьEmailИзКомментария(Стр.Комментарий);
		КонецЦикла;

		// 3. ОДИН запрос: email -> контрагент
		МапаКонтрагентовПоEmail = ПолучитьМапуКонтрагентовПоEmail(
			ТЗДокументов.ВыгрузитьКолонку("Email"));

		// 4. Привязка контрагентов
		СчетчикИдентифицировано = 0;
		Для Каждого Стр Из ТЗДокументов Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Email) Тогда
				Продолжить;
			КонецЕсли;
			Контрагент = МапаКонтрагентовПоEmail.Получить(НРег(Стр.Email));
			Если ЗначениеЗаполнено(Контрагент) Тогда
				Стр.Контрагент = Контрагент;
				СчетчикИдентифицировано = СчетчикИдентифицировано + 1;
			КонецЕсли;
		КонецЦикла;

		Если СчетчикИдентифицировано = 0 Тогда
			Возврат "Контрагенты не найдены. Добавьте email в КонтактнуюИнформацию контрагентов.";
		КонецЕсли;

		// 5. Группировка по (ТС, Контрагент, ДатаДень)
		ГруппыДляОбъединения = СгруппироватьПоТСКонтрагентДата(ТЗДокументов);

		// 6. ОДИН запрос: целевые документы (мастера для доливания)
		МапаЦелевыхДокументов = ПолучитьМапуЦелевыхДокументов(ГруппыДляОбъединения);

		// 7. Обработка групп - транзакция на каждую группу
		Счетчики = Новый Структура("Объединено, Долито, Помечено, ОшибокГрупп", 0, 0, 0, 0);
		Для Каждого КВ Из ГруппыДляОбъединения Цикл
			ОбработатьГруппуПересборки(КВ.Ключ, КВ.Значение, МапаЦелевыхДокументов, Счетчики);
		КонецЦикла;

		// 8. Обновить списки
		ЗаполнитьДинамическиеСписки();

		ТекстИтога = "Идентифицировано: " + СчетчикИдентифицировано
			+ ", объединено: " + Счетчики.Объединено
			+ ", долито в существующие: " + Счетчики.Долито
			+ ", помечено на удаление: " + Счетчики.Помечено;
		Если Счетчики.ОшибокГрупп > 0 Тогда
			ТекстИтога = ТекстИтога + ", ошибок групп: " + Счетчики.ОшибокГрупп;
		КонецЕсли;
		Возврат ТекстИтога;

	Исключение
		ЗаписьЖурналаРегистрации("АРМ.Пересборка",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Возврат "Ошибка пересборки: " + ОписаниеОшибки();
	КонецПопытки;

КонецФункции

// Возвращает ТЗ неидентифицированных документов за период.
// Колонки: Ссылка, Комментарий, ОсновноеТС, Дата, Email (заполняется выше), Контрагент (заполняется выше).
&НаСервере
Функция ПолучитьНеидентифицированныеДокументы()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Комментарий КАК Комментарий,
	|	Док.ОсновноеТС КАК ОсновноеТС,
	|	Док.Дата КАК Дата
	|ИЗ
	|	Документ.ОперацияПоПоручительству КАК Док
	|ГДЕ
	|	Док.СтатусОперации = &СтатусНеИдентифицирован
	|	И Док.Дата >= &ДатаНачала
	|	И Док.Дата <= &ДатаОкончания
	|	И НЕ Док.ПометкаУдаления";
	Запрос.УстановитьПараметр("СтатусНеИдентифицирован", Перечисления.СтатусыОпераций.НеИдентифицирован);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));

	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("Email", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Возврат ТЗ;
КонецФункции

// Извлекает email из комментария. Поддерживает 3 формата:
//   #email#, "name" <email>, просто email в тексте. Возвращает "" если не найден.
&НаСервере
Функция ИзвлечьEmailИзКомментария(Комментарий)

	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		Возврат "";
	КонецЕсли;

	Email = "";
	Комм = СокрЛП(Комментарий);

	// 1. Формат #email@domain.ru#
	Позиция1 = СтрНайти(Комм, "#");
	Если Позиция1 > 0 Тогда
		Позиция2 = СтрНайти(Комм, "#", , , 2);
		Если Позиция2 > Позиция1 + 1 Тогда
			Email = СокрЛП(Сред(Комм, Позиция1 + 1, Позиция2 - Позиция1 - 1));
		КонецЕсли;
	КонецЕсли;

	// 2. Формат "name" <email>
	Если СтрНайти(Email, "@") = 0 И СтрНайти(Комм, "<") > 0 Тогда
		П1 = СтрНайти(Комм, "<");
		П2 = СтрНайти(Комм, ">");
		Если П2 > П1 + 1 Тогда
			Email = СокрЛП(Сред(Комм, П1 + 1, П2 - П1 - 1));
		КонецЕсли;
	КонецЕсли;

	// 3. Просто email в тексте
	Если СтрНайти(Email, "@") = 0 И СтрНайти(Комм, "@") > 0 Тогда
		Email = СтрЗаменить(СокрЛП(Комм), """", "");
	КонецЕсли;

	Если СтрНайти(Email, "@") = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат Email;

КонецФункции

// Один пакетный запрос: для всех уникальных email из массива - найти контрагента.
// КИ.Представление контрагентов с типом АдресЭлектроннойПочты выгружается одним запросом,
// затем в памяти ищется подстрочное совпадение с каждым email.
// Возвращает Соответствие: НРег(email) -> СправочникСсылка.Контрагенты.
&НаСервере
Функция ПолучитьМапуКонтрагентовПоEmail(МассивEmail)

	Мапа = Новый Соответствие;

	УникальныеEmail = Новый Массив;
	Для Каждого Email Из МассивEmail Цикл
		Если НЕ ЗначениеЗаполнено(Email) Тогда
			Продолжить;
		КонецЕсли;
		EmailНорм = НРег(СокрЛП(Email));
		Если Мапа.Получить(EmailНорм) = Неопределено Тогда
			Мапа.Вставить(EmailНорм, Справочники.Контрагенты.ПустаяСсылка());
			УникальныеEmail.Добавить(EmailНорм);
		КонецЕсли;
	КонецЦикла;

	Если УникальныеEmail.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КИ.Ссылка КАК Контрагент,
	|	КИ.Представление КАК Представление
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КИ
	|ГДЕ
	|	КИ.Тип = &ТипАдресЭП
	|	И НЕ КИ.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТипАдресЭП", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПредстЛоу = НРег(СокрЛП(Выборка.Представление));
		Если НЕ ЗначениеЗаполнено(ПредстЛоу) Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого EmailНорм Из УникальныеEmail Цикл
			Если СтрНайти(ПредстЛоу, EmailНорм) > 0
				И НЕ ЗначениеЗаполнено(Мапа.Получить(EmailНорм)) Тогда
				Мапа.Вставить(EmailНорм, Выборка.Контрагент);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Мапа;

КонецФункции

// Группирует строки документов по ключу (ТС | Контрагент | ДатаДень).
// Возвращает Соответствие: КлючГруппы -> Структура(Контрагент, ТС, ДатаДень, Ссылки[]).
&НаСервере
Функция СгруппироватьПоТСКонтрагентДата(ТЗДокументов)

	Группы = Новый Соответствие;
	Для Каждого Стр Из ТЗДокументов Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Контрагент) Тогда
			Продолжить;
		КонецЕсли;
		КодТС = Строка(Стр.ОсновноеТС);
		ДатаДень = НачалоДня(Стр.Дата);
		Если ЗначениеЗаполнено(КодТС) Тогда
			Ключ = КодТС + "|"
				+ Строка(Стр.Контрагент.УникальныйИдентификатор()) + "|"
				+ Формат(ДатаДень, "ДФ=yyyyMMdd");
		Иначе
			Ключ = "SINGLE_" + Стр.Ссылка.УникальныйИдентификатор();
		КонецЕсли;
		Если Группы.Получить(Ключ) = Неопределено Тогда
			Группа = Новый Структура("Контрагент, ТС, ДатаДень, Ссылки",
				Стр.Контрагент, Стр.ОсновноеТС, ДатаДень, Новый Массив);
			Группы.Вставить(Ключ, Группа);
		КонецЕсли;
		Группы.Получить(Ключ).Ссылки.Добавить(Стр.Ссылка);
	КонецЦикла;
	Возврат Группы;

КонецФункции

// Один пакетный запрос: для всех групп найти существующий целевой документ
// (тот же Контрагент+ТС+ДатаДень со статусом <> НеИдентифицирован).
// Возвращает Соответствие: КлючГруппы -> Объект документа (или Неопределено).
&НаСервере
Функция ПолучитьМапуЦелевыхДокументов(Группы)

	Мапа = Новый Соответствие;
	Если Группы.Количество() = 0 Тогда
		Возврат Мапа;
	КонецЕсли;

	ТЗКлючей = Новый ТаблицаЗначений;
	ТЗКлючей.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	ТЗКлючей.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗКлючей.Колонки.Добавить("ТС");
	ТЗКлючей.Колонки.Добавить("НачалоДня", Новый ОписаниеТипов("Дата"));
	ТЗКлючей.Колонки.Добавить("КонецДня", Новый ОписаниеТипов("Дата"));

	Контрагенты = Новый Массив;
	НачалоПериодаГрупп = '39991231';
	КонецПериодаГрупп = '00010101';
	Для Каждого КВ Из Группы Цикл
		Если СтрНайти(КВ.Ключ, "SINGLE_") > 0 Тогда
			Продолжить;
		КонецЕсли;
		ТекГруппа = КВ.Значение;
		НовСтр = ТЗКлючей.Добавить();
		НовСтр.Ключ = КВ.Ключ;
		НовСтр.Контрагент = ТекГруппа.Контрагент;
		НовСтр.ТС = ТекГруппа.ТС;
		НовСтр.НачалоДня = ТекГруппа.ДатаДень;
		НовСтр.КонецДня = КонецДня(ТекГруппа.ДатаДень);
		Если Контрагенты.Найти(ТекГруппа.Контрагент) = Неопределено Тогда
			Контрагенты.Добавить(ТекГруппа.Контрагент);
		КонецЕсли;
		Если ТекГруппа.ДатаДень < НачалоПериодаГрупп Тогда
			НачалоПериодаГрупп = ТекГруппа.ДатаДень;
		КонецЕсли;
		Если КонецДня(ТекГруппа.ДатаДень) > КонецПериодаГрупп Тогда
			КонецПериодаГрупп = КонецДня(ТекГруппа.ДатаДень);
		КонецЕсли;
	КонецЦикла;

	Если ТЗКлючей.Количество() = 0 Тогда
		Возврат Мапа;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ОсновноеТС КАК ОсновноеТС,
	|	НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) КАК ДатаДень
	|ИЗ
	|	Документ.ОперацияПоПоручительству КАК Док
	|ГДЕ
	|	Док.Контрагент В (&Контрагенты)
	|	И Док.СтатусОперации <> &СтатусНеИдентифицирован
	|	И НЕ Док.ПометкаУдаления
	|	И Док.Дата >= &НачалоПериода
	|	И Док.Дата <= &КонецПериода";
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("СтатусНеИдентифицирован", Перечисления.СтатусыОпераций.НеИдентифицирован);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаГрупп);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаГрупп);

	КандидатыПоКлючу = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючКандидата = Строка(Выборка.ОсновноеТС) + "|"
			+ Строка(Выборка.Контрагент.УникальныйИдентификатор()) + "|"
			+ Формат(Выборка.ДатаДень, "ДФ=yyyyMMdd");
		Если КандидатыПоКлючу.Получить(КлючКандидата) = Неопределено Тогда
			КандидатыПоКлючу.Вставить(КлючКандидата, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из ТЗКлючей Цикл
		Ссылка = КандидатыПоКлючу.Получить(Стр.Ключ);
		Если Ссылка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТекГруппа = Группы.Получить(Стр.Ключ);
		Если ТекГруппа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТекГруппа.Ссылки.Найти(Ссылка) <> Неопределено Тогда
			// Кандидат сам внутри группы - не доливаем сам в себя
			Продолжить;
		КонецЕсли;
		Мапа.Вставить(Стр.Ключ, Ссылка);
	КонецЦикла;

	Возврат Мапа;

КонецФункции

// Обрабатывает одну группу пересборки: объединение или доливание.
// Каждая группа в своей транзакции — при сбое одной остальные продолжают работу.
// Счетчики (Структура) дополняется по ссылке.
&НаСервере
Процедура ОбработатьГруппуПересборки(КлючГруппы, Группа, МапаЦелевых, Счетчики)

	НовыйКонтрагент = Группа.Контрагент;
	МассивСсылок = Группа.Ссылки;
	ЦелевойСсылка = МапаЦелевых.Получить(КлючГруппы);
	ЦелевойДок = Неопределено;
	Если ЦелевойСсылка <> Неопределено И МассивСсылок.Найти(ЦелевойСсылка) = Неопределено Тогда
		ЦелевойДок = ЦелевойСсылка.ПолучитьОбъект();
	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		Если ЦелевойДок <> Неопределено Тогда
			МастерДок = ЦелевойДок;
			ДокументыДляПереноса = МассивСсылок;
			ПризнакДолито = Истина;
		ИначеЕсли МассивСсылок.Количество() = 1 Тогда
			МастерДок = МассивСсылок[0].ПолучитьОбъект();
			МастерДок.Контрагент = НовыйКонтрагент;
			МастерДок.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
			Возврат;
		Иначе
			МастерДок = МассивСсылок[0].ПолучитьОбъект();
			МастерДок.Контрагент = НовыйКонтрагент;
			ДокументыДляПереноса = Новый Массив;
			Для Инд = 1 По МассивСсылок.ВГраница() Цикл
				ДокументыДляПереноса.Добавить(МассивСсылок[Инд]);
			КонецЦикла;
			ПризнакДолито = Ложь;
		КонецЕсли;

		Для Каждого ДонорСсылка Из ДокументыДляПереноса Цикл
			ДонорДок = ДонорСсылка.ПолучитьОбъект();
			ПеренестиДанныеДонора(ДонорДок, МастерДок);
			ДонорДок.ПометкаУдаления = Истина;
			ДонорДок.Записать();
			Счетчики.Помечено = Счетчики.Помечено + 1;
		КонецЦикла;

		МастерДок.Записать(РежимЗаписиДокумента.Проведение);

		ЗафиксироватьТранзакцию();

		Если ПризнакДолито Тогда
			Счетчики.Долито = Счетчики.Долито + 1;
		Иначе
			Счетчики.Объединено = Счетчики.Объединено + 1;
		КонецЕсли;

	Исключение
		ОтменитьТранзакцию();
		Счетчики.ОшибокГрупп = Счетчики.ОшибокГрупп + 1;
		ДанныеОшибки = Новый Структура;
		ДанныеОшибки.Вставить("КлючГруппы", КлючГруппы);
		ДанныеОшибки.Вставить("Контрагент", НовыйКонтрагент);
		ДанныеОшибки.Вставить("Подробно", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("АРМ.Пересборка.Группа",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ОперацияПоПоручительству, , ,
			ДанныеОшибки);
	КонецПопытки;

КонецПроцедуры

// Переносит ТЧ ДанныеДокументов и КодыCMR из донора в мастер.
// Если ДанныеДокументов донора пуста - формирует строку из шапки.
&НаСервере
Процедура ПеренестиДанныеДонора(ДонорДок, МастерДок)

	Для Каждого СтрДД Из ДонорДок.ДанныеДокументов Цикл
		НоваяДД = МастерДок.ДанныеДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяДД, СтрДД);
	КонецЦикла;

	Если ДонорДок.ДанныеДокументов.Количество() = 0 Тогда
		НоваяДД = МастерДок.ДанныеДокументов.Добавить();
		НоваяДД.НомерГТД = ДонорДок.НомерГТД;
		НоваяДД.СуммаОбеспечения = ДонорДок.СуммаОбеспечения;
		НоваяДД.Валюта = ДонорДок.ВалютаОбеспечения;
		НоваяДД.Расстояние = ДонорДок.Расстояние;
		НоваяДД.ПунктОтправления = ДонорДок.ПунктОтправления;
		НоваяДД.ПунктНазначения = ДонорДок.ПунктНазначения;
		НоваяДД.СтатусТранзита = ДонорДок.СтатусТранзита;
		НоваяДД.ДатаОформления = ДонорДок.Дата;
		НоваяДД.УникальныйИдентификатор = ДонорДок.ВнешнийИдентификатор;
	КонецЕсли;

	Для Каждого СтрCMR Из ДонорДок.КодыCMR Цикл
		НовCMR = МастерДок.КодыCMR.Добавить();
		ЗаполнитьЗначенияСвойств(НовCMR, СтрCMR);
	КонецЦикла;

КонецПроцедуры
// Доработка END

&НаКлиенте
Процедура ОбновитьОперации(Команда)
	ОбновитьОперацииНаСервере(Команда.Имя);
КонецПроцедуры

&НаСервере
Процедура ОбновитьОперацииНаСервере(Имя)

	// Доработка {H-11 2026-05-20}: соответствие имя кнопки -> статус (вместо магической цепочки Если).
	// Поддержаны оба варианта опечатки НеРасчитан/НеРассчитан - на случай рассинхрона имени в Form.xml.
	КартаСтатусов = Новый Соответствие;
	КартаСтатусов.Вставить("ТребуетРК",          Перечисления.СтатусыОпераций.ТребуетРучнойКорректировки);
	КартаСтатусов.Вставить("НеРасчитан",         Перечисления.СтатусыОпераций.НеРассчитан);
	КартаСтатусов.Вставить("НеРассчитан",        Перечисления.СтатусыОпераций.НеРассчитан);
	КартаСтатусов.Вставить("НеИдентифицирован",  Перечисления.СтатусыОпераций.НеИдентифицирован);
	КартаСтатусов.Вставить("Обработан",          Перечисления.СтатусыОпераций.Обработан);
	КартаСтатусов.Вставить("ГотовоКОплате",      Перечисления.СтатусыОпераций.ГотовоКОплате);
	КартаСтатусов.Вставить("Завершен",           Перечисления.СтатусыОпераций.Завершен);

	Если Имя = "Все" Тогда
		ВсеОперации.Отбор.Элементы.Очистить();
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ОтборУточнения = ВсеОперации.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборУточнения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
			ОтборУточнения.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборУточнения.Использование = Истина;
			ОтборУточнения.ПравоеЗначение = Объект.Контрагент;
		КонецЕсли;
		КоличествоВСписках();
		Возврат;
	КонецЕсли;

	Статус = КартаСтатусов.Получить(Имя);
	Если Статус = Неопределено Тогда
		ЗаписьЖурналаРегистрации("АРМ.ОбновитьОперации",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Неизвестное имя кнопки фильтра: " + Имя);
		Возврат;
	КонецЕсли;

	ЗаполнитьДинамическиеСписки();

	ОтборУточнения = ВсеОперации.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУточнения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОперации");
	ОтборУточнения.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУточнения.Использование = Истина;
	ОтборУточнения.ПравоеЗначение = Статус;

	Элементы.ВсеОперации.Обновить();
	КоличествоВСписках();

КонецПроцедуры

Процедура КоличествоВСписках() 
		
	КоличествоОшибок = ПосчитатьКоличествоВСпискеНаСервере(Элементы.СписокОшибочныеОперации);
	Элементы.ВкладкаТребуютУточнения.Заголовок = "Требуют уточнения" + " (" + КоличествоОшибок + ")"; 
	
	КоличествоКРасчету = ПосчитатьКоличествоВСпискеНаСервере(Элементы.СписокОшибокРасчетов);
	Элементы.КРасчету.Заголовок = "К расчету" + " (" + КоличествоКРасчету + ")";  
	
	КоличествоКРасчету = ПосчитатьКоличествоВСпискеНаСервере(Элементы.СписокГотовыхОпераций);
	Элементы.ГотовыКОтправке.Заголовок = "Готовы к отгрузке" + " (" + КоличествоКРасчету + ")";     
	
	КоличествоКРасчету = ПосчитатьКоличествоВСпискеНаСервере(Элементы.ВсеОперации);
	Элементы.ВкладкаВсеОперации.Заголовок = "Все" + " (" + КоличествоКРасчету + ")";
	
КонецПроцедуры	

&НаСервере
Функция ПосчитатьКоличествоВСпискеНаСервере(Список)
	
	Схема = Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = МакетКомпоновки.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
	
	ПозВыбратьНачало = СтрНайти(Запрос.Текст, "ВЫБРАТЬ ", НаправлениеПоиска.СКонца);
	Пока НЕ ПозВыбратьНачало = 1
		и НЕ Сред(Запрос.Текст, ПозВыбратьНачало - 1, 1) = Символы.ПС Цикл
		ПозВыбратьНачало = СтрНайти(Запрос.Текст, "ВЫБРАТЬ ", НаправлениеПоиска.СКонца, ПозВыбратьНачало - 1);
	КонецЦикла;
	ПозВыбратьКонец = СтрНайти(Запрос.Текст, Символы.ПС,, ПозВыбратьНачало);
	
	СтрокаВЫБРАТЬ = Лев(Запрос.Текст, ПозВыбратьКонец);
	СтрокаИз = Сред(Запрос.Текст, СтрНайти(Запрос.Текст, Символы.ПС + "ИЗ" + Символы.ПС,, ПозВыбратьКонец));
	
	Если СтрНайти(СтрокаИз, Символы.ПС + "СГРУППИРОВАТЬ") Тогда
		СтрокаИз = Лев(СтрокаИз, СтрНайти(СтрокаИз, Символы.ПС + "СГРУППИРОВАТЬ"));
	КонецЕсли;
	
	Запрос.Текст = СтрокаВЫБРАТЬ + "Количество(*) КАК Кол" + СтрокаИз;
	Если СтрНайти(Запрос.Текст, Символы.ПС + "УПОРЯДОЧИТЬ ПО",, ПозВыбратьКонец) Тогда
		Запрос.Текст = Лев(Запрос.Текст, СтрНайти(Запрос.Текст, Символы.ПС + "УПОРЯДОЧИТЬ ПО",, ПозВыбратьКонец));
	КонецЕсли;
	
	Для Каждого парам из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Значение);
	КонецЦикла;
	
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		ЗаписьЖурналаРегистрации("АРМ.КоличествоВСписке." + ЭтаФорма.ИмяФормы,
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Возврат 0;
	КонецПопытки;

	Выборка = Результат.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Выборка.Кол;
КонецФункции

&НаКлиенте
Процедура Расчитать(Команда)

	Если ВыполняетсяМассоваяОперация = Истина Тогда
		ПоказатьПредупреждение(, "Дождитесь завершения предыдущей операции.");
		Возврат;
	КонецЕсли;

	Если Элементы.СписокОшибокРасчетов.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите хотя бы одну строку в списке «К расчету».");
		Возврат;
	КонецЕсли;

	ВыполняетсяМассоваяОперация = Истина;
	Попытка
		РасчитатьНаСервере();
		ЗаполнитьДинамическиеСписки();
	Исключение
		ВыполняетсяМассоваяОперация = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	ВыполняетсяМассоваяОперация = Ложь;

КонецПроцедуры

&НаСервере
Процедура РасчитатьНаСервере()

	ВыдСтроки = Элементы.СписокОшибокРасчетов.ВыделенныеСтроки;

	// Доработка {Perf #1 2026-05-01}: один запрос ВНЕ цикла вместо N запросов внутри.
	МапаТарифов = ПолучитьМапуТарифовЗаказчиков(ВыдСтроки);

	// Доработка {SS-8 2026-04-20}: защита от падения всего цикла при ошибке одного документа.
	// Доработка {UX-4 2026-05-20}: агрегация сообщений «нет тарифной сетки» в один сводный текст
	//                              вместо N всплывающих сообщений.
	СчУспех = 0;
	СчОшибок = 0;
	КонтрагентыБезСетки = Новый Соответствие;

	Для Каждого Стр Из ВыдСтроки Цикл
		Попытка
			Если ТипЗнч(Стр) <> Тип("ДокументСсылка.ОперацияПоПоручительству") Тогда
				Продолжить;
			КонецЕсли;
			Док = Стр.ПолучитьОбъект();
			Если Док = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЕстьТарифДляДокумента(Док, МапаТарифов) Тогда
				исРасчет.ОбновитьЦеныНаСервере(Док);
				Док.Оплата = Док.ОплатыУслуг.Итог("Сумма")
					+ Док.ОплатыУслуг.Итог("СуммаКодов")
					+ Док.ДополнительныеУслуги.Итог("Сумма");
				Если Док.АгентскоеВознаграждениеПроцент <> 0 Тогда
					Док.АгентскоеВознаграждениеСумма = Окр(Док.АгентскоеВознаграждениеПроцент * Док.Оплата / 100, 2);
				КонецЕсли;
				Док.Записать(РежимЗаписиДокумента.Проведение);
				СчУспех = СчУспех + 1;
			Иначе
				КолТекущее = КонтрагентыБезСетки.Получить(Док.Контрагент);
				Если КолТекущее = Неопределено Тогда
					КолТекущее = 0;
				КонецЕсли;
				КонтрагентыБезСетки.Вставить(Док.Контрагент, КолТекущее + 1);
				СчОшибок = СчОшибок + 1;
			КонецЕсли;
		Исключение
			СчОшибок = СчОшибок + 1;
			ЗаписьЖурналаРегистрации(
				"АРМ.РасчитатьНаСервере",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ОперацияПоПоручительству,
				Стр,
				ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(
				"Ошибка расчета документа " + Строка(Стр) + ": " + ОписаниеОшибки(),
				Стр); // АдресатСообщения - оператор может кликнуть и открыть документ
		КонецПопытки;
	КонецЦикла;

	// Сводное сообщение по контрагентам без тарифной сетки
	Если КонтрагентыБезСетки.Количество() > 0 Тогда
		ТекстПробл = "Не заполнена тарифная сетка у контрагентов:" + Символы.ПС;
		Для Каждого КВ Из КонтрагентыБезСетки Цикл
			ТекстПробл = ТекстПробл + " - " + Строка(КВ.Ключ)
				+ " (документов: " + КВ.Значение + ")" + Символы.ПС;
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю(ТекстПробл);
	КонецЕсли;

	Если СчУспех + СчОшибок > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Расчет завершен: успешно " + СчУспех + ", с ошибками " + СчОшибок + ".");
	КонецЕсли;

КонецПроцедуры

// Доработка {Perf #1 2026-05-01}: один запрос всех тарифов для выделенных документов.
// МоментВремени = МАКС(Док.Дата) - для проверки наличия тарифа достаточно последнего среза.
&НаСервере
Функция ПолучитьМапуТарифовЗаказчиков(ВыдСтроки)

	Контрагенты = Новый Массив;
	МаксДата = Дата(1, 1, 1);
	Для Каждого Стр Из ВыдСтроки Цикл
		Если ТипЗнч(Стр) <> Тип("ДокументСсылка.ОперацияПоПоручительству") Тогда
			Продолжить;
		КонецЕсли;
		Контрагенты.Добавить(Стр.Контрагент);
		Если Стр.Дата > МаксДата Тогда
			МаксДата = Стр.Дата;
		КонецЕсли;
	КонецЦикла;

	Если Контрагенты.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТарифныеСеткиОбеспеченияСрезПоследних.Контрагент КАК Контрагент,
	|	ТарифныеСеткиОбеспеченияСрезПоследних.СпецЦены КАК СпецЦены
	|ИЗ
	|	РегистрСведений.ТарифныеСеткиОбеспечения.СрезПоследних(
	|			&МоментВремени,
	|			Контрагент В (&Контрагенты)) КАК ТарифныеСеткиОбеспеченияСрезПоследних";
	Запрос.УстановитьПараметр("МоментВремени", МаксДата);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);

	Мапа = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СпецЦены Тогда
			СпецФлаг = "1";
		Иначе
			СпецФлаг = "0";
		КонецЕсли;
		Ключ = Строка(Выборка.Контрагент.УникальныйИдентификатор()) + "|" + СпецФлаг;
		Мапа.Вставить(Ключ, Истина);
	КонецЦикла;

	Возврат Мапа;

КонецФункции

// Lookup в мапе тарифов вместо запроса в цикле.
// Возвращает Истина если у контрагента документа есть тариф; иначе Ложь (без побочных эффектов).
&НаСервере
Функция ЕстьТарифДляДокумента(Док, МапаТарифов)

	Если Док.СпецЦены Тогда
		СпецФлаг = "1";
	Иначе
		СпецФлаг = "0";
	КонецЕсли;
	Ключ = Строка(Док.Контрагент.УникальныйИдентификатор()) + "|" + СпецФлаг;
	Возврат МапаТарифов.Получить(Ключ) <> Неопределено;

КонецФункции


&НаКлиенте
Процедура ЗаполнитьКонтрагентовИзВсех(Команда)

	Если НЕ ЗначениеЗаполнено(ДобавитьВДокКонтрагента) Тогда
		ПоказатьПредупреждение(, "Выберите контрагента для заполнения (поле «Добавить в документ контрагента»).");
		Возврат;
	КонецЕсли;

	Количество = Элементы.ВсеОперации.ВыделенныеСтроки.Количество();
	Если Количество = 0 Тогда
		ПоказатьПредупреждение(, "Выделите хотя бы одну строку в списке «Все».");
		Возврат;
	КонецЕсли;

	ТекстВопроса = "Заменить контрагента у " + Количество
		+ " выделенных документов на «" + Строка(ДобавитьВДокКонтрагента) + "»?"
		+ Символы.ПС + "Действие необратимо.";
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьКонтрагентовИзВсехЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтрагентовИзВсехЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Если ВыполняетсяМассоваяОперация = Истина Тогда
		ПоказатьПредупреждение(, "Дождитесь завершения предыдущей операции.");
		Возврат;
	КонецЕсли;

	ВыполняетсяМассоваяОперация = Истина;
	Попытка
		Итог = ЗаполнитьКонтрагентаИзВсехНаСервере();
	Исключение
		ВыполняетсяМассоваяОперация = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	ВыполняетсяМассоваяОперация = Ложь;

	ПоказатьПредупреждение(, Итог);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьКонтрагентаИзВсехНаСервере()

	Массив = Элементы.ВсеОперации.ВыделенныеСтроки;

	СчУспех = 0;
	СчОшибок = 0;
	Для Каждого Стр Из Массив Цикл
		Попытка
			Док = Стр.ПолучитьОбъект();
			Док.Контрагент = ДобавитьВДокКонтрагента;
			Док.Записать(РежимЗаписиДокумента.Проведение);
			СчУспех = СчУспех + 1;
		Исключение
			СчОшибок = СчОшибок + 1;
			ЗаписьЖурналаРегистрации(
				"АРМ.ЗаполнениеКонтрагентаИзВсех",
				УровеньЖурналаРегистрации.Ошибка,
				Стр.Метаданные(),
				Стр,
				ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	ЗаполнитьДинамическиеСписки();

	Возврат "Заполнение завершено: успешно " + СчУспех + ", с ошибками " + СчОшибок + ".";

КонецФункции

&НаКлиенте
Процедура СоздатьТарифнуюСетку(Команда)

	Если Элементы.СписокОшибокРасчетов.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выберите хотя бы одну строку в списке «К расчету».");
		Возврат;
	КонецЕсли;

	Контр = ПолучитьКлиентаНаСервере(Элементы.СписокОшибокРасчетов.ВыделенныеСтроки[0]);
	
	Парам = новый Структура();
	Парам.Вставить("Контрагент", Контр);
	
	ОткрытьФорму("Обработка.УстановкаЦенКонтрагентов.Форма.ФормаУпр",Парам,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

// Доработка {M-5 2026-05-20}: без ПолучитьОбъект() — не грузим весь документ ради одного реквизита.
&НаСервереБезКонтекста
Функция ПолучитьКлиентаНаСервере(Док)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Контрагент");
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьДинамическиеСписки();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	Если НЕ ПроверкаКонтрагента() Тогда
		ПоказатьПредупреждение(, "Заполните контрагента в шапке АРМ.");
		Возврат;
	КонецЕсли;

	ВыделСтроки = Элементы.СписокГотовыхОпераций.ВыделенныеСтроки;
	Если ВыделСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите хотя бы одну строку в списке «Готовы к отгрузке».");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Данные", ВыделСтроки);
	ПараметрыОткрытия.Вставить("Команда", Команда.Имя);
	ПараметрыОткрытия.Вставить("Контрагент", Объект.Контрагент);

	ОткрытьФорму("Обработка.АРМ.Форма.ВыборРеестров", ПараметрыОткрытия, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПроверкаКонтрагента()  
	
	Если Объект.Контрагент <> Справочники.Контрагенты.ПустаяСсылка() тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
		
КонецФункции
#Область РаботаСОтчетами 
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Доработка {8.5-совместимость 2026-05-20}: асинхронный диалог вместо .Выбрать().
	СтандартнаяОбработка = Ложь;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ПутьКФайлу;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Каталог не выбран.");
		Возврат;
	КонецЕсли;
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)

	Если НЕ ПроверкаКонтрагента() Тогда
		ПоказатьПредупреждение(, "Заполните контрагента в шапке АРМ.");
		Возврат;
	КонецЕсли;

	ВыделСтроки = Элементы.СписокГотовыхОпераций.ВыделенныеСтроки;
	Если ВыделСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите хотя бы одну строку в списке «Готовы к отгрузке».");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Данные", ВыделСтроки);
	ПараметрыОткрытия.Вставить("Команда", Команда.Имя);
	ПараметрыОткрытия.Вставить("Контрагент", Объект.Контрагент);

	ОткрытьФорму("Обработка.АРМ.Форма.ВыборРеестров", ПараметрыОткрытия, , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаСервере
Функция СформироватьПечатнуюФормуРеестрыНаСервере()  
	
	Отчет = Отчеты.РеестрОказанныхУслуг.Создать();   
	ТабДокумент = Новый ТабличныйДокумент();   
	
	НастройкиКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки(); 
	
	МассивДокументов = Элементы.СписокГотовыхОпераций.ВыделенныеСтроки; 
		
 	//Отбор по статусам
	ОтборСтатусы = НастройкиКД.Отбор.Элементы.Получить(1);     
	ОтборСтатусы.Использование = Ложь;

	//Отбор по контргенту
	ОтборКонтрагента = НастройкиКД.Отбор.Элементы.Получить(2);     
	Если ОтборКонтрагента = неопределено тогда   
		НовыйОтбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ПолеОтбора = новый ПолеКомпоновкиДанных("Контрагент");
		
		НовыйОтбор.ЛевоеЗначение = ПолеОтбора;
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйОтбор.ПравоеЗначение = Объект.Контрагент;
	Иначе	
		ОтборКонтрагента.ПравоеЗначение = Объект.Контрагент;
		ОтборКонтрагента.Использование = Истина;
	КонецЕсли;
	
	// Отбор по договору                   
	
	ОтборДоговор = НастройкиКД.Отбор.Элементы.Получить(0);     
    ОтборДоговор.Использование = Ложь;
	
	// Отбор по документам
	ОтборДокументы = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ПолеОтбора = новый ПолеКомпоновкиДанных("Документ");  
	
	ОтборДокументы.ЛевоеЗначение = ПолеОтбора;
	ОтборДокументы.Использование = Истина;
	ОтборДокументы.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборДокументы.ПравоеЗначение = МассивДокументов;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКД);
	Отчет.СкомпоноватьРезультат(ТабДокумент);
	
	имя = ПолучитьИмяВременногоФайла("xlsx");
	ТабДокумент.Записать(Имя, ТипФайлаТабличногоДокумента.XLSX);
	
	Возврат ТабДокумент;
	
КонецФункции  

&НаКлиенте
Процедура СписокОшибочныеОперацииПриАктивизацииСтроки(Элемент)
	// Доработка {UX 2026-05-20}: убран вызов ЗаполнитьДинамическиеСписки() на каждой
	// активации строки - был лишний серверный round-trip на каждом клике оператора.
	// Списки обновляются при изменении контрагента/периода/рейса или кнопке Обновить.
КонецПроцедуры

&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	ЗаполнитьДинамическиеСписки(); 
КонецПроцедуры

#КонецОбласти
